# Global versus Local variables

## Local variable

In [1]:
# defining a function Onyesha() that will print out alocal variable num which is initialized to 16
def onyesha():
    num=16
    print("the number is",num)

In [2]:
#calling onyesha() function
onyesha()

the number is 16

In [3]:
#trying to acces the local variable num outside the function
num

NameError: name 'num' is not defined

#### The error above comes because num is only known within the function called onyesha. It is therefore a local variable in the function

## Global variable

In [4]:
# defining a function onyesha() that will print out the variable num which is initialized to 16
num=16
def onyesha():
    print("the number is",num)

In [5]:
onyesha()

the number is 16

In [6]:
num

16

#### In this case num is a global variable since we can access it outside the function

# Recursive functions

In [ ]:
# functions that can use themselves

In [7]:
def factorial(number):
    if number==1:
        return 1
    else:
        return number*factorial(number-1)

In [9]:
factorial(5)

120

In [10]:
factorial(4)

24

In [11]:
factorial(3)

6

In [12]:
factorial(2)

2

In [13]:
factorial(1)

1

In [14]:
factorial(0)

RecursionError: maximum recursion depth exceeded

In [16]:
def factorial(number):
    if number==1:
        return 1
    elif number==0:
        return 1
    elif number<0:
        print ("Invalid number. Please enter a positive number")
    else:
        return number*factorial(number-1)

In [20]:
number=int(input("please enter your number"))
factorial(number)

please enter your number 0

1

# PYTHON PANDAS

In [ ]:
# IS A PACKAGE USED TO DEAL WITH TABULAR DATA(DATA IN TABLES)
# A table in pandas is called a dataframe

In [21]:
import pandas as pd

### Creating a dataframe

### Creating a dataframe from a dictionary

In [22]:
Sonek_web_visit={'Day':[1,2,3,4,5,6],'Visitors':[1000,2000,3000,4000,5000,6000],'Bounce Rate':[10,20,30,40,50,60]}

In [23]:
Sonek_web_visit.keys()

dict_keys(['Day', 'Visitors', 'Bounce Rate'])

In [24]:
Sonek_web_visit.values()

dict_values([[1, 2, 3, 4, 5, 6], [1000, 2000, 3000, 4000, 5000, 6000], [10, 20, 30, 40, 50, 60]])

In [25]:
df1=pd.DataFrame(Sonek_web_visit)

In [26]:
df1

   Day  Visitors  Bounce Rate
0    1      1000           10
1    2      2000           20
2    3      3000           30
3    4      4000           40
4    5      5000           50
5    6      6000           60

## Creating Data Frames by reading from an external file

### pd.read_csv for .csv extensions and pd.read_excel for .xlxs extensions

In [27]:
product_df=pd.read_csv("Product (2).csv")

In [28]:
product_df

   Product_ID Product_Name     Category  Price Seller_City
0         101        Watch      Fashion    299       Delhi
1         102          Bag      Fashion   1350      Mumbai
2         103        Shoes      Fashion   2999     Chennai
3         104   Smartphone  Electronics  14999     Klokata
4         105        Books        Study    145       Delhi
5         106          Oil      Grocery    110     Chennai
6         107       Laptop  Electronics  79999   Bengalore

In [29]:
# to show the top 5 rows
product_df.head()

   Product_ID Product_Name     Category  Price Seller_City
0         101        Watch      Fashion    299       Delhi
1         102          Bag      Fashion   1350      Mumbai
2         103        Shoes      Fashion   2999     Chennai
3         104   Smartphone  Electronics  14999     Klokata
4         105        Books        Study    145       Delhi

In [30]:
product_df.head(3)

   Product_ID Product_Name Category  Price Seller_City
0         101        Watch  Fashion    299       Delhi
1         102          Bag  Fashion   1350      Mumbai
2         103        Shoes  Fashion   2999     Chennai

In [31]:
# to show the bottom 5 rows
product_df.tail()

   Product_ID Product_Name     Category  Price Seller_City
2         103        Shoes      Fashion   2999     Chennai
3         104   Smartphone  Electronics  14999     Klokata
4         105        Books        Study    145       Delhi
5         106          Oil      Grocery    110     Chennai
6         107       Laptop  Electronics  79999   Bengalore

In [32]:
product_df.tail(2)

   Product_ID Product_Name     Category  Price Seller_City
5         106          Oil      Grocery    110     Chennai
6         107       Laptop  Electronics  79999   Bengalore